---
kind: property
id: P:Autodesk.Revit.UI.UIThemeManager.CurrentTheme
source: html/0b4c281a-6f15-ff69-792f-ef52182c316e.htm
---
# Autodesk.Revit.UI.UIThemeManager.CurrentTheme Property

The current overall theme which impacts the Revit frame and canvas.

## Syntax (C#)
```csharp
public static UITheme CurrentTheme { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration